Repository: coinpaprika/telegram-bot-v2
Catalog: locales/*/default.po
Languages: ar, fa, pl, ru

source: Command help message
ar: يرجى استخدام أحد الأوامر التالية: /start أو /help لعرض هذه الرسالة /o \<رمز\> عرض نظرة عامة على العملة /p \<رمز\> عرض سعر العملة /s \<رمز\> عرض العرض المتداول /v \<رمز\> عرض حجم التداول خلال 24 ساعة /c \<رمز\> عرض مخطط السعر $\<رمز\> عرض نظرة عامة على العملة \(مثل: $btc\) /source عرض كود المصدر الخاص بهذا البوت
fa: لطفاً یکی از دستورات زیر را استفاده کنید: /start یا /help نمایش این پیام /o \<نماد\> نمای کلی ارز را مشاهده کنید /p \<نماد\> قیمت ارز را بررسی کنید /s \<نماد\> عرضه در گردش را بررسی کنید /v \<نماد\> حجم معاملات 24 ساعته را بررسی کنید /c \<نماد\> نمودار قیمت را مشاهده کنید $\<نماد\> نمای کلی ارز را مشاهده کنید \(مانند: $btc\) /source نمایش کد منبع این ربات
pl: Użyj jednej z poniższych komend: /start lub /help pokazuje tę wiadomość /o \<symbol\> sprawdź podsumowanie monety /p \<symbol\> sprawdź cenę monety /s \<symbol\> sprawdź ilość w obiegu /v \<symbol\> sprawdź 24\-godzinny wolumen /c \<symbol\> wygeneruj wykres cenowy $\<symbol\> sprawdź podsumowanie monety \(np\.\, $btc\) /source pokazuje kod źródłowy tego bota
ru: Пожалуйста, используйте одну из команд: /start или /help показать это сообщение /o \<символ\> просмотреть обзор монеты /p \<символ\> проверить цену монеты /s \<символ\> проверить циркулирующий объем /v \<символ\> проверить объем за 24 часа /c \<символ\> получить график цен $\<символ\> просмотреть обзор монеты \(например: $btc\) /source показать исходный код этого бота

source: Coin not found
ar: يبدو أننا لا نمتلك العملة التي تبحث عنها\. الرجاء المحاولة باستخدام رمز عملة آخر
fa: به نظر می‌رسد که ما ارزی که به دنبال آن هستید را نداریم\. لطفاً یک نماد ارز دیگر را امتحان کنید
pl: Wygląda na to, że nie mamy monety, której szukasz\. Spróbuj użyć innego symbolu monety
ru: Похоже, у нас нет монеты, которую вы ищете\. Пожалуйста, попробуйте другой символ монеты

source: Coin not traded
ar: [%s (%s)](https://coinpaprika.com/coin/%s) العملة غير متداولة حاليًا ولا يوجد لها سعر حالي. لمزيد من التفاصيل، قم بزيارة [CoinPaprika](https://coinpaprika.com/coin/%s)🌶
fa: [%s (%s)](https://coinpaprika.com/coin/%s) این ارز در حال حاضر معامله نمی‌شود و قیمت فعلی ندارد. برای اطلاعات بیشتر به [CoinPaprika](https://coinpaprika.com/coin/%s)🌶 مراجعه کنید.
pl: [%s (%s)](https://coinpaprika.com/coin/%s) moneta nie jest aktywnie handlowana i nie ma aktualnej ceny\. Więcej szczegółów znajdziesz na [CoinPaprika](https://coinpaprika.com/coin/%s)🌶
ru: [%s (%s)](https://coinpaprika.com/valjuta/%s) монета в настоящее время не торгуется и не имеет текущей цены. Для получения дополнительной информации посетите [CoinPaprika](https://coinpaprika.com/valjuta/%s)🌶

source: Coin price details
ar: *%s السعر:* ▫️`%s` *دولار أمريكي* ▫️`%s` *بيتكوين* %s على [CoinPaprika](https://coinpaprika.com/coin/%s)🌶/ استخدم هذا [البوت](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md)
fa: *قیمت %s:* ▫️`%s` *دلار* ▫️`%s` *بیت‌کوین* %s در [CoinPaprika](https://coinpaprika.com/coin/%s)🌶/ از این [ربات](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md) استفاده کنید
pl: *Cena %s:* ▫️`%s` *USD* ▫️`%s` *BTC* %s na [CoinPaprika](https://coinpaprika.com/coin/%s)🌶/ Skorzystaj z tego [Bota](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md)
ru: *Цена %s:* ▫️`%s` *USD* ▫️`%s` *BTC* %s на [CoinPaprika](https://coinpaprika.com/valjuta/%s)🌶/ Используйте этого [бота](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md)

source: Coin volume details
ar: *حجم تداول %s خلال 24 ساعة:* ▫️`%s` *دولار أمريكي* %s على [CoinPaprika](https://coinpaprika.com/coin/%s)🌶/ استخدم هذا [البوت](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md)
fa: *حجم معاملات 24 ساعته %s:* ▫️`%s` *دلار* %s در [CoinPaprika](https://coinpaprika.com/coin/%s)🌶/ از این [ربات](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md) استفاده کنید
pl: *Wolumen 24h %s:* ▫️`%s` *USD* %s na [CoinPaprika](https://coinpaprika.com/coin/%s)🌶/ Skorzystaj z tego [Bota](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md)
ru: *Объем торгов %s за 24 часа:* ▫️`%s` *USD* %s на [CoinPaprika](https://coinpaprika.com/valjuta/%s)🌶/ Используйте этого [бота](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md)

source: Coin supply details
ar: *العرض المتداول لـ %s:* ▫️`%s` %s على [CoinPaprika](https://coinpaprika.com/coin/%s)🌶/ استخدم هذا [البوت](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md)
fa: *عرضه در گردش %s:* ▫️`%s` %s در [CoinPaprika](https://coinpaprika.com/coin/%s)🌶/ از این [ربات](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md) استفاده کنید
pl: *Podaż w obiegu %s:* ▫️`%s` %s na [CoinPaprika](https://coinpaprika.com/coin/%s)🌶/ Skorzystaj z tego [Bota](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md)
ru: *Объем циркуляции %s:* ▫️`%s` %s на [CoinPaprika](https://coinpaprika.com/valjuta/%s)🌶/ Используйте этого [бота](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md)

source: Coin chart details
ar: %s على [CoinPaprika](https://coinpaprika.com/coin/%s) 🌶/ استخدم هذا [البوت](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md)
fa: %s در [CoinPaprika](https://coinpaprika.com/coin/%s) 🌶/ از این [ربات](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md) استفاده کنید
pl: %s na [CoinPaprika](https://coinpaprika.com/coin/%s) 🌶/ Skorzystaj z tego [Bota](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md)
ru: %s на [CoinPaprika](https://coinpaprika.com/valjuta/%s) 🌶/ Используйте этого [бота](https://github.com/coinpaprika/telegram-bot-v2/blob/main/README.md)

source: Ticker details
ar: [%s](https://coinpaprika.com/coin/%s) \(%s\) السعر: *\$%s* تغير السعر خلال ساعة: *%s%%* تغير السعر خلال 24 ساعة: *%s%%* تغير السعر خلال 7 أيام: *%s%%* الحجم: *\$%s* القيمة السوقية: *\$%s* العرض المتداول: *%s %s* إجمالي العرض: *%s %s* [%s على CoinPaprika](https://coinpaprika.com/coin/%s) 🌶
fa: [%s](https://coinpaprika.com/coin/%s) \(%s\) قیمت: *\$%s* تغییر قیمت در 1 ساعت: *%s%%* تغییر قیمت در 24 ساعت: *%s%%* تغییر قیمت در 7 روز: *%s%%* حجم معاملات: *\$%s* ارزش بازار: *\$%s* عرضه در گردش: *%s %s* کل عرضه: *%s %s* [%s در CoinPaprika](https://coinpaprika.com/coin/%s) 🌶
pl: [%s](https://coinpaprika.com/coin/%s) \(%s\) Cena: *\$%s* Zmiana ceny w 1h: *%s%%* Zmiana ceny w 24h: *%s%%* Zmiana ceny w 7d: *%s%%* Wolumen: *\$%s* Kapitalizacja rynkowa: *\$%s* Podaż w obiegu: *%s %s* Całkowita podaż: *%s %s* [%s na CoinPaprika](https://coinpaprika.com/coin/%s) 🌶
ru: [%s](https://coinpaprika.com/valjuta/%s) \(%s\) Цена: *\$%s* Изменение за 1ч: *%s%%* Изменение за 24ч: *%s%%* Изменение за 7д: *%s%%* Объем: *\$%s* Рыночная капитализация: *\$%s* Циркулирующий объем: *%s %s* Общий объем: *%s %s* [%s на CoinPaprika](https://coinpaprika.com/valjuta/%s) 🌶

source: price chart 4h
ar: مخطط أسعار %s لمدة 4 ساعات (%s) - كوين بابريكا
fa: نمودار قیمت %s در ۴ ساعت گذشته (%s) - کوین پاپریکا
pl: %s Wykres cen z ostatnich 4 godzin (%s) - CoinPaprika
ru: %s График цен за 4 часа (%s) - CoinPaprika

source: price chart 12h
ar: مخطط أسعار %s لمدة 12 ساعة (%s) - كوين بابريكا
fa: نمودار قیمت %s در ۱۲ ساعت گذشته (%s) - کوین پاپریکا
pl: %s Wykres cen z ostatnich 12 godzin (%s) - CoinPaprika
ru: %s График цен за 12 часов (%s) - CoinPaprika

source: price chart 24h
ar: مخطط أسعار %s لمدة 24 ساعة (%s) - كوين بابريكا
fa: نمودار قیمت %s در ۲۴ ساعت گذشته (%s) - کوین پاپریکا
pl: %s Wykres cen z ostatnich 24 godzin (%s) - CoinPaprika
ru: %s График цен за 24 часа (%s) - CoinPaprika

source: price chart 7d
ar: مخطط أسعار %s لمدة 7 أيام (%s) - كوين بابريكا
fa: نمودار قیمت %s در ۷ روز گذشته (%s) - کوین پاپریکا
pl: %s Wykres cen z ostatnich 7 dni (%s) - CoinPaprika
ru: %s График цен за 7 дней (%s) - CoinPaprika

source: Invalid alert data.
ar: ❌ بيانات التنبيه غير صالحة.
fa: ❌ اطلاعات هشدار نامعتبر است.
pl: ❌ Nieprawidłowe dane alertu.
ru: ❌ Неверные данные оповещения.

source: Failed to save alert. Please try again later.
ar: ❌ فشل في حفظ التنبيه. الرجاء المحاولة لاحقًا.
fa: ❌ ذخیره هشدار با شکست مواجه شد. لطفاً بعداً دوباره امتحان کنید.
pl: ❌ Nie udało się zapisać alertu. Spróbuj ponownie później.
ru: ❌ Не удалось сохранить оповещение. Попробуйте позже.

source: Alert saved successfully.
ar: ✅ تم حفظ التنبيه بنجاح.
fa: ✅ هشدار با موفقیت ذخیره شد.
pl: ✅ Alert został pomyślnie zapisany.
ru: ✅ Оповещение успешно сохранено.

source: Please send the full link of the coin with target price %s
ar: ❗ الرجاء إرسال الرابط الكامل للعملة مع السعر المستهدف *%s*
fa: ❗ لطفاً لینک کامل کوین با قیمت هدف *%s* را ارسال کنید
pl: ❗ Proszę podać pełny link do monety z ceną docelową *%s*
ru: ❗ Пожалуйста, отправьте полную ссылку на монету с целевой ценой *%s*

source: e.g., coinpaprika.com/coin/btc-bitcoin/
ar: على سبيل المثال، coinpaprika.com/coin/btc-bitcoin/
fa: مثال: coinpaprika.com/coin/btc-bitcoin/
pl: np. coinpaprika.com/coin/btc-bitcoin/
ru: например, coinpaprika.com/coin/btc-bitcoin/

source: Failed to prompt for a reply. Please try again.
ar: ❌ فشل في طلب الرد. الرجاء المحاولة مرة أخرى.
fa: ❌ درخواست پاسخ با شکست مواجه شد. لطفاً دوباره امتحان کنید.
pl: ❌ Nie udało się poprosić o odpowiedź. Spróbuj ponownie.
ru: ❌ Не удалось запросить ответ. Пожалуйста, попробуйте снова.

source: Please reply with the full coin link.
ar: ℹ️ الرجاء الرد بالرابط الكامل للعملة.
fa: ℹ️ لطفاً با لینک کامل کوین پاسخ دهید.
pl: ℹ️ Proszę odpowiedzieć pełnym linkiem do monety.
ru: ℹ️ Пожалуйста, ответьте полной ссылкой на монету.

source: Unknown action. Please try again.
ar: ❌ إجراء غير معروف. الرجاء المحاولة مرة أخرى.
fa: ❌ اقدام ناشناخته. لطفاً دوباره امتحان کنید.
pl: ❌ Nieznana akcja. Spróbuj ponownie.
ru: ❌ Неизвестное действие. Попробуйте снова.

source: Please send the full link of the coin
ar: ℹ️ يرجى إرسال الرابط الكامل للعملة.
fa: ℹ️ لطفاً لینک کامل کوین را ارسال کنید.
pl: ℹ️ Proszę podać pełny link do monety.
ru: ℹ️ Пожалуйста, отправьте полную ссылку на монету.

source: Could not extract the target price. Please start again.
ar: ❌ لم يتمكن من استخراج السعر المستهدف. يرجى المحاولة مرة أخرى.
fa: ❌ نمی‌توان قیمت هدف را استخراج کرد. لطفاً دوباره تلاش کنید.
pl: ❌ Nie udało się wydobyć ceny docelowej. Proszę spróbować ponownie.
ru: ❌ Не удалось извлечь целевую цену. Пожалуйста, начните заново.

source: Invalid link format. Please provide a valid coin link, such as https://coinpaprika.com/coin/sol-solana/
ar: ❌ تنسيق الرابط غير صالح. يرجى تقديم رابط صالح للعملة، مثل: https://coinpaprika.com/coin/sol-solana/.
fa: ❌ قالب لینک نامعتبر است. لطفاً یک لینک معتبر مانند: https://coinpaprika.com/coin/sol-solana/ ارائه دهید.
pl: ❌ Nieprawidłowy format linku. Proszę podać prawidłowy link do monety, np. https://coinpaprika.com/coin/sol-solana/.
ru: ❌ Неверный формат ссылки. Пожалуйста, предоставьте действительную ссылку на монету, например: https://coinpaprika.com/coin/sol-solana/.

source: Failed to search for the coin.
ar: ❌ فشل في البحث عن العملة.
fa: ❌ جستجوی کوین با شکست مواجه شد.
pl: ❌ Nie udało się wyszukać monety.
ru: ❌ Не удалось найти монету.

source: Failed to save alert with the provided link. Please try again.
ar: ❌ فشل في حفظ التنبيه بالرابط المقدم. يرجى المحاولة مرة أخرى.
fa: ❌ ذخیره هشدار با لینک ارائه شده ناموفق بود. لطفاً دوباره تلاش کنید.
pl: ❌ Nie udało się zapisać alertu z podanym linkiem. Proszę spróbować ponownie.
ru: ❌ Не удалось сохранить оповещение с предоставленной ссылкой. Пожалуйста, попробуйте снова.

source: alert_command_usage
ar: الاستخدام: /alert {الرمز} {الهدف} (مثال: /alert btc 98000$ أو /alert btc 10%)
fa: نحوه استفاده: /alert {نماد} {هدف} (مثال: /alert btc 98000$ یا /alert btc 10%)
pl: Użycie: /alert {ticker} {cel} (np. /alert btc 98000$ lub /alert btc 10%)
ru: Использование: /alert {тикер} {цель} (например, /alert btc 98000$ или /alert btc 10%)

source: coin_search_failed
ar: ❌ فشل في البحث عن العملة.
fa: ❌ جستجوی کوین با شکست مواجه شد.
pl: ❌ Nie udało się wyszukać monety.
ru: ❌ Не удалось найти монету.

source: coin_display_format
ar: %s (%s)
fa: %s (%s)
pl: %s (%s)
ru: %s (%s)

source: coin_search_results
ar: تم العثور على %d نتيجة لـ %s. يرجى اختيار واحدة أو إرسال الرابط يدويًا:
fa: برای %s تعداد %d نتیجه یافت شد. لطفاً یکی را انتخاب کنید یا لینک را به صورت دستی ارسال کنید:
pl: Znaleziono %d wynik(ów) dla %s. Wybierz jeden lub wyślij link ręcznie:
ru: Найдено %d результат(ов) для %s. Выберите один или отправьте ссылку вручную:

source: alert_manual_link_option
ar: لا شيء من هذه الخيارات، سأرسل الرابط
fa: هیچ‌کدام از این موارد، من لینک را ارسال می‌کنم
pl: Żaden z tych, wyślę link
ru: Ни один из них, я отправлю ссылку

source: coin_selection_buttons_failed
ar: فشل إرسال أزرار اختيار العملة: %v
fa: ارسال دکمه‌های انتخاب کوین ناموفق بود: %v
pl: Nie udało się wysłać przycisków wyboru monety: %v
ru: Не удалось отправить кнопки выбора монеты: %v

source: invalid_percent_target
ar: قيمة الهدف بالنسبة المئوية غير صالحة.
fa: مقدار درصد هدف نامعتبر است.
pl: Aktualna cena dla [%s](https://coinpaprika.com/coin/%s) to: *%s*\. Upewnij się, że używasz poprawnego formatu procentowego do ustawienia alertu.
ru: Неверное значение целевого процента.

source: invalid_price_target
ar: قيمة الهدف السعري غير صالحة.
fa: مقدار قیمت هدف نامعتبر است.
pl: Aktualna cena dla [%s](https://coinpaprika.com/coin/%s) to: *%s*\. Upewnij się, że używasz poprawnego formatu ceny do ustawienia alertu.
ru: Неверное значение целевой цены.

source: current_price_not_found
ar: فشل في الحصول على السعر الحالي للعملة.
fa: دریافت قیمت فعلی کوین ناموفق بود.
pl: Nie udało się uzyskać aktualnej ceny dla monety.
ru: Не удалось получить текущую цену для монеты.

source: alert_save_failed
ar: فشل في حفظ التنبيه.
fa: ذخیره هشدار ناموفق بود.
pl: Nie udało się zapisać alertu.
ru: Не удалось сохранить оповещение.

source: database_insert_failed
ar: فشل في إدخال التنبيه في قاعدة البيانات.
fa: درج هشدار در پایگاه داده ناموفق بود.
pl: Nie udało się wstawić alertu do bazy danych.
ru: Не удалось вставить оповещение в базу данных.

source: alert_set_success
ar: ✅ تم تعيين التنبيه لـ *%s* عند *%s*
fa: ✅ هشدار برای *%s* با مقدار *%s* تنظیم شد.
pl: ✅ Alert ustawiony dla [%s](https://coinpaprika.com/coin/%s) na *%s*
ru: ✅ Оповещение установлено для *%s* на *%s*

source: error_fetching_alerts
ar: خطأ في جلب التنبيهات: %v
fa: خطا در دریافت هشدارها: %v
pl: Błąd podczas pobierania alertów: %v
ru: Ошибка при получении оповещений: %v

source: fetch_alerts_failed
ar: ❌ فشل في جلب التنبيهات الخاصة بك. يرجى المحاولة لاحقاً.
fa: ❌ دریافت هشدارهای شما ناموفق بود. لطفاً دوباره تلاش کنید.
pl: ❌ Nie udało się pobrać Twoich alertów. Spróbuj ponownie później.
ru: ❌ Не удалось получить ваши оповещения. Попробуйте позже.

source: no_active_alerts
ar: ℹ️ *لا توجد تنبيهات نشطة* ليس لديك أي تنبيهات حالياً. استخدم `/addalert` لإنشاء واحد.
fa: ℹ️ *هیچ هشداری فعال نیست* شما هیچ هشداری تنظیم نکرده‌اید. برای ایجاد هشدار از `/addalert` استفاده کنید.
pl: ℹ️ *Brak aktywnych alertów* Nie masz obecnie żadnych alertów. Użyj `/addalert`, aby utworzyć jeden.
ru: ℹ️ *Нет активных оповещений* У вас пока нет настроенных оповещений. Используйте `/addalert`, чтобы создать одно.

source: active_alerts_list_header
ar: 🔔 *تنبيهاتك النشطة:*
fa: 🔔 *هشدارهای فعال شما:*
pl: 🔔 *Twoje aktywne alerty:*
ru: 🔔 *Ваши активные оповещения:*

source: alert_target_percent
ar: 📉 التغيير: `%s%%`
fa: 📉 تغییر: `%s%%`
pl: 📉 Zmiana: `%s%%`
ru: 📉 Изменение: `%s%%`

source: alert_target_price
ar: 💲 السعر: `$%s`
fa: 💲 قیمت: `$%s`
pl: 💲 Cena: `$%s`
ru: 💲 Цена: `$%s`

source: alert_target_generic
ar: 🎯 الهدف: `%s`
fa: 🎯 هدف: `%s`
pl: 🎯 Cel: `%s`
ru: 🎯 Цель: `%s`

source: alert_list_item_format
ar: ▫️ *%s \(%s\)* %s 📅 تمت الإضافة: %s
fa: ▫️ *%s \(%s\)* %s 📅 اضافه شده: %s
pl: ▫️ *%s \(%s\)* %s 📅 Dodano: %s
ru: ▫️ *%s \(%s\)* %s 📅 Добавлено: %s

source: no_context_for_reply
ar: ❌ لا يوجد سياق لهذه الرد. الرجاء المحاولة مرة أخرى.
fa: ❌ برای این پاسخ متنی یافت نشد. لطفاً دوباره تلاش کنید.
pl: ❌ Nie znaleziono kontekstu dla tej odpowiedzi. Spróbuj ponownie.
ru: ❌ Контекст для этого ответа не найден. Попробуйте снова.

source: no_reply_message
ar: ❌ تحتاج إلى الرد على رسالة صالحة.
fa: ❌ شما باید به یک پیام معتبر پاسخ دهید.
pl: ❌ Musisz odpowiedzieć na ważną wiadomość.
ru: ❌ Вы должны ответить на действительное сообщение.

source: invalid_link_format
ar: ❌ تنسيق الرابط غير صالح. الرجاء تقديم رابط عملة صحيح مثل https://coinpaprika.com/coin/sol-solana/
fa: ❌ فرمت لینک نامعتبر است. لطفاً یک لینک معتبر ارائه دهید، مانند https://coinpaprika.com/coin/sol-solana/
pl: ❌ Nieprawidłowy format linku. Proszę podać poprawny link do monety, na przykład https://coinpaprika.com/coin/sol-solana/
ru: ❌ Неверный формат ссылки. Пожалуйста, укажите правильную ссылку на монету, например https://coinpaprika.com/coin/sol-solana/
